Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/N13C.tmx
Source language: en_us
Languages: zh_cn

source: Sleeping out
zh_cn: 露营

source: He had always thought the Sahara would be white, but it wasn't; it was terra-cotta brown.
zh_cn: 他一直以为撒哈拉是白色的，可它并非白色，而是一种粘土般的棕色。

source: The rolling sand dunes were the curves of her body the summer they met and the following summer they married.
zh_cn: 起伏的沙丘是那年夏天他们相遇时，以及第二年他们结婚时，她曼妙的身体曲线。

source: That hill was the slope of her back, and over there was the valley between her shoulder blades where he kissed her each night as they lay in bed.
zh_cn: 那座小山是她的背，那边的谷地是每晚他们躺在床上，他吻她的时候她的肩胛骨间的凹陷。

source: It had been her desire to ride a camel through the Sahara and to see the world and to be filled with it.
zh_cn: 她曾经一直想骑着骆驼走过整个撒哈拉，无拘无束地畅游世界。

source: She married him, and he promised that someday, after all their hard work, they would travel the world together.
zh_cn: 她与他结婚后，他曾承诺，多年在辛苦工作之后， 终有一天他们会一起环游世界。

source: And now here he was, without the one person he had promised to bring.
zh_cn: 现在他就在撒哈拉，身边却没有了那个他承诺与之同游的人。

source: Enveloped in an untamed wind, his eyes and nose filled with sand.
zh_cn: 狂暴的风沙环绕着他，他的口鼻里塞满了沙子。

source: He took a small plastic film canister from his pocket, removed the lid, and the heaving storm lapped out the bottle's contents.
zh_cn: 他从口袋里掏出一个塑料胶片盒，取下盖子。起伏的风暴把内容物打翻出来。

source: An ounce of the ashes of the love of his life disappeared into the desert around him.
zh_cn: 一盎司的骨灰，他毕生的挚爱，就这样消失在四周的沙漠中。

source: He leaned his body against the wind. It stung his face, burned his nose, and he glared at the desert and tried to blink the Sahara out of his eyes.
zh_cn: 他斜靠在风中，风沙吹痛了他的面颊，他的鼻子刺痛。他瞪眼看着沙漠，想把眼中的撒哈拉眨出来。

source: The wind blew harder, he fell to his knees, pressed his forehead to the ground, and kissed the silty earth.
zh_cn: 风更大了，他跪倒在地，将额头按在地上，吻了地上的粉砂。

source: Under the ever-maddening red desert moon the old man watched a wall of sand stalking toward him.
zh_cn: 那一轮亘古笼罩着沙漠的血红月亮高悬着，老人看着一面沙墙向他逼近。
